spoemb/linkit-v4-core/ports/nrf52840/main.cpp
FSM_INITIAL_STATE(GenTracker, BootState)

/// @brief Number of IS25 flash blocks reserved for OTA firmware images (last 1 MB).
#define OTA_UPDATE_RESERVED_BLOCKS ((1024 * 1024) / IS25_BLOCK_SIZE)

/// @brief Reed switch debounce time in ms.
/// @note Increased from 25 ms to 250 ms to filter noise from VSENSORS rail switching.
#define REED_SWITCH_DEBOUNCE_TIME_MS    250


/**
 * @brief Infinite fault indicator — blinks the RGB LED and kicks the watchdog forever.
 *
 * Uses NrfRGBLed::set_color_raw() for bare-metal GPIO access (no timer/scheduler dependency).
 *
 * Fault color map:
 *   - RED 50 ms      → HardFault
 *   - YELLOW 50 ms   → MemManagement
 *   - MAGENTA 50 ms  → Stack overflow (__stack_chk_fail)
 *   - CYAN 50 ms     → Malloc failure
 *   - RED 200 ms     → ETL assertion
 *
 * @param color    LED color identifying the fault type.
 * @param delay_ms Blink half-period in milliseconds (default 50 ms).
 */
[[noreturn]] static void fault_blink_loop(RGBLedColor color, unsigned int delay_ms = 50) {
	for (;;) {
#ifdef GPIO_LED_REG
		GPIOPins::set(GPIO_LED_REG);
#endif
		NrfRGBLed::set_color_raw(BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, color);
		nrf_delay_ms(delay_ms);
		NrfRGBLed::set_color_raw(BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::BLACK);
		nrf_delay_ms(delay_ms);
		PMU::kick_watchdog();
	}
}

extern "C" void HardFault_Handler() {
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::HARDFAULT); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::RED);
#endif
}

extern "C" void MemoryManagement_Handler(void) {
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::MMAN); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::YELLOW);
#endif
}

extern "C" {
	/// @brief Stack canary value for -fstack-protector.  Fixed constant — see review note.
	void *__stack_check_guard = (void*)0xDEADBEEF;
	/// @brief Called by -fstack-protector when the canary is corrupted.
	void __wrap___stack_chk_fail(void) {
#ifdef NDEBUG
		PMU::save_stack(PMULogType::STACK);
		PMU::reset(false);
#else
		fault_blink_loop(RGBLedColor::MAGENTA);
#endif
	}
}

extern "C" void vApplicationMallocFailedHook() {
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::MALLOC); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::CYAN);
#endif
}

/** @brief ETL library error callback — logs the exception then resets or blinks.
 *  @param e  ETL exception with file/line info.
 */
void etl_error_handler(const etl::exception& e)
{
	DEBUG_TRACE("ETL error: %s in %s : %u", e.what(), e.file_name(), e.line_number());
#ifdef NDEBUG
	for (;;) { PMU::save_stack(PMULogType::ETL); PMU::reset(false); }
#else
	fault_blink_loop(RGBLedColor::RED, 200);
#endif
}

/**
 * @brief Low-level write override — routes stdout/printf to the active debug channel.
 *
 * Overrides the weak newlib _write() so that printf / std::cout output is directed
 * to UART, USB CDC, or BLE NUS depending on g_debug_mode.
 *
 * @param file  File descriptor (unused — all output goes to debug channel).
 * @param ptr   Data buffer to write.
 * @param len   Number of bytes to write.
 * @return Always returns @p len (bytes accepted, even if output is suppressed).
 * @note Safe to call from ISR context only for UART and USB CDC paths.
 *       BLE NUS path checks __get_IPSR() and skips if in interrupt context.
 */
extern "C" int _write(int file, char *ptr, int len)
{
#ifdef DEBUG_UART_TX_PIN
	if (g_debug_mode == BaseDebugMode::UART && NrfDebugUart::is_init())
		NrfDebugUart::write(ptr, len);
	else
#endif
	if (g_debug_mode == BaseDebugMode::USB_CDC && m_is_debug_init)
		NrfUSB::write(ptr, len);
	else if (ble_service && !__get_IPSR() && g_debug_mode == BaseDebugMode::BLE_NUS) {
		ble_service->write_best_effort(std::string(ptr, len));
	}
	return len;
}


// ═══════════════════════════════════════════════════════════════
// Init sub-functions
//
// Each phase creates static objects (in .bss/.data) and assigns
// global pointers.  This keeps main() readable and reduces its
// stack frame — static objects are visible in the linker map.
// ═══════════════════════════════════════════════════════════════

/** @brief References returned by init_peripherals() for use in subsequent init phases. */
struct InitContext {
	NrfSwitch& reed;   ///< Reed switch — needed by power-on check, gesture, and dive mode
	Is25Flash& flash;   ///< External NOR flash — needed by LFS and OTA updater
};

/**
 * @brief Phase 1 — Initialise core peripherals.
 *
 * Sets up: PMU, watchdog, GPIO, RTC, hardware timer, debug output (UART/USB/BLE),
 * NFC pin check, RGB LED, external LED, reed switch, buzzer, BLE stack, IS25 flash.
 *
 * @return InitContext with references to reed switch and flash for subsequent phases.
 */
/// @brief Very-early storage-mode bailout — re-enters System OFF if the device
/// just woke from PSEUDO_POWER_OFF (a brief Hall switch trigger / environmental
/// magnet) and there is no magnet held at boot. Without this, a spurious Hall
/// trigger would cause the MCU to sit forever in the WFE wait loop of
/// `init_power_on_check`, burning ~3-5 µA continuously even though no real
/// user gesture happened.
///
/// Called BEFORE start_watchdog() — the nRF52 WDT keeps running in System OFF
/// and would trigger a `WDT_RESET` cycle every WDT timeout, defeating the
/// purpose. Must also run before SoftDevice is enabled, so we use the bare
/// `NRF_POWER->SYSTEMOFF` instead of `sd_power_system_off()`.
///
/// Wake path from System OFF: any HIGH level on REED_SW (Hall switch fires =
/// pin pulled high) triggers a full chip reset; we re-enter this function and
/// either confirm a held magnet (→ proceed to normal boot) or go back to
/// System OFF.
#ifdef PSEUDO_POWER_OFF
static void early_storage_off_check()
{
	// Read RESETREAS BEFORE PMU::initialise() touches it. PSEUDO_POWER_OFF
	// is encoded as GPREGRET=0x80 + SREQ reset cause. Only act if BOTH match.
	uint32_t resetreas = NRF_POWER->RESETREAS;
	uint32_t gpregret  = NRF_POWER->GPREGRET;

