spoemb/linkit-v4-core/ports/nrf52840/main.cpp
	bool was_pseudo_power_off =
		(resetreas & POWER_RESETREAS_SREQ_Msk) && (gpregret == 0x80);

	if (!was_pseudo_power_off) {
		return;  // Not a wake from storage — proceed to normal init
	}

	// Configure reed pin to read its current state (no GPIOTE / no IRQ yet).
	// LinkIt V4: GPIO_REED_SW = P1.03, PULLDOWN, ACTIVE_STATE = HIGH (Hall
	// switch closed → REED_MCU drives reed pin HIGH).
	const uint32_t reed_pin = BSP::GPIO_Inits[BSP::GPIO_REED_SW].pin_number;
	nrf_gpio_cfg_input(reed_pin, NRF_GPIO_PIN_PULLDOWN);

	// Tiny settle delay — pulldown needs a few µs to discharge the pin cap.
	nrf_delay_us(50);

	if (nrf_gpio_pin_read(reed_pin) == REED_SWITCH_ACTIVE_STATE) {
		// Magnet IS present at boot — could be a real user gesture. Let the
		// normal init flow take over (it will do the full 3 s held-check).
		return;
	}

	// No magnet at boot — this was a spurious Hall trigger. Re-arm System OFF
	// with SENSE wake on REED_SW going HIGH (magnet field detected), then
	// drop into the deepest sleep available.

	// Make absolutely sure no peripheral / SoftDevice is keeping us awake by
	// re-configuring REED_SW as SENSE input. nrf_gpio_cfg_sense_input does
	// the right magic to register a PORT event source on the pin.
	nrf_gpio_cfg_sense_input(reed_pin,
		NRF_GPIO_PIN_PULLDOWN,
		(REED_SWITCH_ACTIVE_STATE != 0) ? NRF_GPIO_PIN_SENSE_HIGH
		                                : NRF_GPIO_PIN_SENSE_LOW);

	// Clear GPREGRET so the next wake doesn't re-enter this path until we
	// actually go through powerdown() again. Without this clear, every cold
	// boot via Hall would re-detect "PSEUDO_POWER_OFF + magnet released" and
	// bounce right back into System OFF — fine in theory but masks real
	// power-on resets (insertion of battery while magnet absent).
	NRF_POWER->GPREGRET = 0;

	// Belt-and-braces: latch the SREQ bit cleared so the next wake reports
	// the true reset cause (POWER_ON for battery insertion, or GPIO).
	NRF_POWER->RESETREAS = NRF_POWER->RESETREAS;

	// Enter System OFF. CPU halts, RAM unpowered (except RAMRET if configured),
	// only the SENSE detector watches REED_SW. Wake = full chip reset.
	NRF_POWER->SYSTEMOFF = 1;

	// Should never reach here, but per nRF52840 errata the SYSTEMOFF write
	// can be racy if an interrupt is pending; fall through to a SystemReset
	// so we at least don't hang in undefined state.
	for (;;) { __WFE(); __WFI(); }
}
#endif

static InitContext init_peripherals()
{
#ifdef PSEUDO_POWER_OFF
	// Storage-mode wake filter: if we woke from PSEUDO_POWER_OFF without a
	// magnet held, immediately re-enter System OFF (deepest sleep, ~0.4 µA
	// chip + ~1.7 µA Hall switch = ~2 µA total). Must run BEFORE start_watchdog
	// otherwise WDT keeps ticking in System OFF and resets us periodically.
	early_storage_off_check();
#endif

	PMU::initialise();
#ifndef DEBUG_NO_WATCHDOG
	PMU::start_watchdog();
	PMU::kick_watchdog();
#endif
	GPIOPins::initialise();
	etl::error_handler::set_callback<etl_error_handler>();

	rtc = &NrfRTC::get_instance();
	NrfRTC::get_instance().init();

	DEBUG_TRACE("Timer...");
	system_timer = &NrfTimer::get_instance();
	NrfTimer::get_instance().init();

	// Init debug output (UART, USB CDC, BLE, or NONE)
	m_is_debug_init = true;
	static ConsoleLog console_log;
	if (g_debug_mode == BaseDebugMode::NONE) {
		DebugLogger::console_log = nullptr;
	} else {
		DebugLogger::console_log = &console_log;
#ifdef DEBUG_UART_TX_PIN
		if (g_debug_mode == BaseDebugMode::UART) {
			NrfDebugUart::init(DEBUG_UART_TX_PIN);
		} else
#endif
		{
			NrfUSB::init();
		}
	}
	setvbuf(stdout, NULL, _IONBF, 0);
	nrf_log_redirect_init();

	// Verify NFC pins are configured as GPIO (P0.09/P0.10 used for SPI CS and SWS_OUT)
	{
		uint32_t nfcpins = NRF_UICR->NFCPINS;
		if ((nfcpins & UICR_NFCPINS_PROTECT_Msk) == (UICR_NFCPINS_PROTECT_NFC << UICR_NFCPINS_PROTECT_Pos)) {
			DEBUG_ERROR("UICR: NFC pins still in NFC mode (0x%08X) — P0.09/P0.10 unusable as GPIO!", nfcpins);
		} else {
			DEBUG_INFO("UICR: NFC pins configured as GPIO (0x%08X)", nfcpins);
		}
	}

	DEBUG_TRACE("RGB LED...");
	static NrfRGBLed nrf_status_led("STATUS", BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::WHITE);
	status_led = &nrf_status_led;

#ifdef EXT_LED_PIN
	DEBUG_TRACE("External LED...");
	static GPIOLed gpio_led(EXT_LED_PIN);
	ext_status_led = &gpio_led;
#else
	ext_status_led = nullptr;
#endif

	if (ext_status_led)
		ext_status_led->off();

	DEBUG_TRACE("Reed switch...");
	static NrfSwitch nrf_reed_switch(BSP::GPIO::GPIO_REED_SW, REED_SWITCH_DEBOUNCE_TIME_MS, REED_SWITCH_ACTIVE_STATE);

#ifdef BUZZER_EN_PIN
	DEBUG_TRACE("Buzzer...");
	static Buzzer buzzer(BUZZER_EN_PIN);
	buzzer_ctl = &buzzer;
#else
	buzzer_ctl = nullptr;
#endif

	DEBUG_TRACE("BLE...");
	BleInterface::get_instance().init();

	DEBUG_TRACE("IS25 flash...");
	static Is25Flash is25_flash;
	if (!is25_flash.init()) {
		DEBUG_ERROR("IS25 flash init failed — cannot continue without filesystem");
		fault_blink_loop(RGBLedColor::RED, 100);
	}

	return {nrf_reed_switch, is25_flash};
}


/**
 * @brief Phase 2 — Power-on reed switch gesture check.
 *
 * On power-on reset, the user must hold a magnet on the reed switch for 3 seconds
 * to confirm intentional boot.  Without this gesture the device powers down
 * immediately, preventing accidental wake from battery insertion or transient
 * power glitches.
 *
 * Two code paths depending on board type:
 *  - PSEUDO_POWER_OFF (LinkIt V4): timer-based, handles both real and pseudo power-on.
 *  - Non-PSEUDO (RSPB): simple polling countdown for true power-on reset only.
 *
 * @param nrf_reed_switch  Hardware reed switch instance for state/callback registration.
 */
static void init_power_on_check(NrfSwitch& nrf_reed_switch)
{
	DEBUG_TRACE("PMU Reset Cause = %s", PMU::reset_cause_str());

#ifdef POWER_ON_RESET_REQUIRES_REED_SWITCH
#ifdef PSEUDO_POWER_OFF
	// PSEUDO_POWER_OFF (LinkIt V4): The nRF52 has no true power switch — it uses
	// VSYS_SEL to latch its own supply via a load switch. "Power off" is a soft
	// shutdown (System OFF mode) with VSYS_SEL de-asserted. A reed switch GPIO
	// event wakes the chip, which sees "Pseudo Power On Reset" instead of a real
	// "Power On Reset". This branch handles both reset causes.
	{
		SensorsPowerGuard power_guard;
		NrfI2C::init();
		PMU::hardware_version(); // Side-effect: I2C probes for hardware detection
#if ENABLE_SEA_TEMP_SENSOR
		{
			try {
				EZO_RTD_Sensor rtd; // Puts the device into standby mode
			} catch (...) {}
		}
#endif
		NrfI2C::uninit();
	}
	bool is_linkit_v4 = (strncmp(PMU::hardware_version(), "linkit-v4", 9) == 0);

