spoemb/linkit-v4-core/ports/nrf52840/main.cpp
	ResetCause cause = PMU::reset_cause();
	if ((is_linkit_v4 && cause == ResetCause::PSEUDO_POWER_ON) ||
		(!is_linkit_v4 && (cause == ResetCause::POWER_ON ||
				cause == ResetCause::PSEUDO_POWER_ON))) {

		volatile bool power_on_ready = false;
		system_timer->start();
		Timer::TimerHandle timer_handle;

		if (nrf_reed_switch.get_state()) {
			status_led->set(RGBLedColor::WHITE);
			BUZZER_ON(buzzer_ctl);
			timer_handle = system_timer->add_schedule([&power_on_ready]() {
				DEBUG_TRACE("Reed switch 3s period elapsed");
				power_on_ready = true;
			}, system_timer->get_counter() + 3000);
		} else {
			status_led->off();
			BUZZER_OFF(buzzer_ctl);
		}

		nrf_reed_switch.start([&timer_handle, &power_on_ready](bool state) {
			system_timer->cancel_schedule(timer_handle);
			if (state) {
				DEBUG_TRACE("Reed State: %u", state);
				GPIOPins::set(VSYS_SEL);
				status_led->set(RGBLedColor::WHITE);
				BUZZER_ON(buzzer_ctl);
				timer_handle = system_timer->add_schedule([&power_on_ready]() {
					DEBUG_TRACE("Reed switch 3s period elapsed");
					power_on_ready = true;
				}, system_timer->get_counter() + 3000);
			} else {
				status_led->off();
				GPIOPins::clear(VSYS_SEL);
				BUZZER_OFF(buzzer_ctl);
			}
		});

		GPIOPins::clear(VSYS_SEL);
		while (!power_on_ready) {
			PMU::kick_watchdog();
			PMU::run();
		}

		GPIOPins::set(VSYS_SEL);
		PMU::kick_watchdog();
		nrf_reed_switch.stop();
		BUZZER_BEEP_COUNT(buzzer_ctl,200,200,2);
	}
#else
	// Without PSEUDO_POWER_OFF (RSPB/gentracker): The board has a real power path
	// (TPL5111 or physical switch), so only true "Power On Reset" is checked with
	// a simple 3-second polling countdown — no timer/callback needed.
	if (PMU::reset_cause() == ResetCause::POWER_ON) {
		unsigned int countdown = 3000;
		DEBUG_TRACE("Enter Power On Reed Switch Check");
		while (countdown) {
			if (GPIOPins::value(BSP::GPIO_REED_SW) != REED_SWITCH_ACTIVE_STATE)
				break;
			PMU::delay_ms(1);
			countdown--;
		}

		if (countdown) {
			DEBUG_TRACE("Reed Switch Inactive -- Powering Down...");
			PMU::powerdown();
		}
		DEBUG_TRACE("Exiting Power On Reed Switch Check");
	}
#endif // PSEUDO_POWER_OFF
#endif // POWER_ON_RESET_REQUIRES_REED_SWITCH
}


/**
 * @brief Phase 3 — Storage and configuration.
 *
 * Sets up: scheduler, I2C bus, reed gesture wrapper, LittleFS filesystem
 * (mount or format+mount), configuration store, RTC restoration from flash,
 * and TPL5111 boot counter / modulo check (EXTERNAL_WAKEUP boards).
 *
 * @param nrf_reed_switch  Reed switch for boot-counter magnet override check.
 * @param is25_flash       External flash device for LFS backing store.
 * @return Reference to the mounted LFSFileSystem (static, lives in .bss).
 */
static LFSFileSystem& init_storage(NrfSwitch& nrf_reed_switch, Is25Flash& is25_flash)
{
	DEBUG_TRACE("Scheduler...");
	static Scheduler scheduler(system_timer);
	system_scheduler = &scheduler;

	// VSENSORS must be on during I2C init to prevent bus appearing stuck
	{
		SensorsPowerGuard power_guard;
		NrfI2C::init();
	}

	DEBUG_TRACE("Reed gesture...");
	static ReedSwitch reed_gesture_switch(nrf_reed_switch);
	reed_switch = &reed_gesture_switch;

	DEBUG_TRACE("LFS filesystem...");
	static LFSFileSystem lfs_file_system(&is25_flash, IS25_BLOCK_COUNT - OTA_UPDATE_RESERVED_BLOCKS);
	main_filesystem = &lfs_file_system;

	DEBUG_TRACE("Mount LFS filesystem...");
#ifdef FORCE_FORMAT_FILESYSTEM
	DEBUG_WARN("FORCE_FORMAT_FILESYSTEM enabled - formatting filesystem!");
	if (main_filesystem->format() < 0 || main_filesystem->mount() < 0)
	{
		DEBUG_ERROR("Failed to format LFS filesystem");
		PMU::powerdown();
	}
#else
	if (main_filesystem->mount() < 0)
	{
		DEBUG_TRACE("Format LFS filesystem...");
		if (main_filesystem->format() < 0 || main_filesystem->mount() < 0)
		{
			DEBUG_ERROR("Failed to format LFS filesystem");
			PMU::powerdown();
		}
	}
#endif

	DEBUG_TRACE("Configuration store...");
	static LFSConfigurationStore store(lfs_file_system);
	configuration_store = &store;
	configuration_store->init();

	// Restore last known RTC from flash (enables MGA-ANO assistance and faster GNSS TTFF)
	{
		unsigned int last_rtc = configuration_store->read_param<unsigned int>(ParamID::LAST_KNOWN_RTC);
#ifdef EXTERNAL_WAKEUP
		// Pseudo RTC: advance the last known RTC by WAKEUP_PERIOD at each boot.
		unsigned int wakeup_period = configuration_store->read_param<unsigned int>(ParamID::WAKEUP_PERIOD);
		if (last_rtc > 0 && wakeup_period > 0) {
			unsigned int pseudo_rtc = last_rtc + wakeup_period;
			configuration_store->write_param(ParamID::LAST_KNOWN_RTC, pseudo_rtc);
			rtc->settime(static_cast<std::time_t>(pseudo_rtc));
			DEBUG_INFO("EXTERNAL_WAKEUP: Pseudo RTC set to %u (last=%u + period=%u)", pseudo_rtc, last_rtc, wakeup_period);
		} else {
			DEBUG_INFO("EXTERNAL_WAKEUP: No pseudo RTC available (last_rtc=%u, wakeup_period=%u)", last_rtc, wakeup_period);
		}

		// TPL5111 boot counter management
		unsigned int boot_counter = configuration_store->boot_count_increment();
		DEBUG_INFO("EXTERNAL_WAKEUP: Boot counter = %u", boot_counter);

		// Check if this is not our turn to run based on modulo
		if (boot_counter > 0 && !configuration_store->boot_count_check_modulo(boot_counter)) {
			if (nrf_reed_switch.get_state()) {
				DEBUG_INFO("EXTERNAL_WAKEUP: Magnet detected | skipping modulo powerdown");
			} else {
				DEBUG_INFO("EXTERNAL_WAKEUP: Not our turn to run (modulo check) | powering down");
				status_led->flash(RGBLedColor::YELLOW, 100);
				PMU::delay_ms(300);
				status_led->off();
				PMU::powerdown();
			}
		}
		DEBUG_INFO("EXTERNAL_WAKEUP: Our turn to run | continuing boot");
#else
		// Non-TPL5111 boards: restore last known RTC directly
		if (last_rtc > 0) {
			rtc->settime(static_cast<std::time_t>(last_rtc));
			DEBUG_INFO("Restored LAST_KNOWN_RTC = %u", last_rtc);
		}
#endif
	}

	return lfs_file_system;
}


/**
 * @brief Phase 4 — Battery monitor initialisation.
 *
 * Selects the appropriate battery monitor implementation based on CMake flags:
 *  - BATTERY_MONITOR_ANALOG: nRF SAADC-based (LinkIt V4)
 *  - BATTERY_MONITOR_STC3117: I2C fuel gauge (RSPB)
 *  - BATTERY_MONITOR_FAKE: fixed 4.1 V stub (testing)
 */
static void init_battery()
{
	DEBUG_TRACE("Battery monitor...");
	uint8_t critical_batt_level = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LB_CRITICAL_THRESH));
	uint8_t low_batt_level = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LB_THRESHOLD));

#if defined(BATTERY_MONITOR_ANALOG)
#ifdef BATTERY_ADC
	static NrfBatteryMonitor nrf_battery_monitor(BATTERY_ADC, BATT_CHEM_NCR18650_3100_3400,
			critical_batt_level, low_batt_level);
	battery_monitor = &nrf_battery_monitor;
#else
	static BatteryMonitor stub_battery_monitor(low_batt_level, critical_batt_level);
	battery_monitor = &stub_battery_monitor;
#endif
#elif defined(BATTERY_MONITOR_FAKE)
	DEBUG_INFO("Using FAKE battery monitor (always 4.1V)");
	static FakeBatteryMonitor fake_battery_monitor(critical_batt_level, low_batt_level);
	battery_monitor = &fake_battery_monitor;
#elif defined(BATTERY_MONITOR_STC3117)
	DEBUG_INFO("Using STC3117 fuel gauge battery monitor");
	static GaugeBatteryMonitor stc3117_battery_monitor(critical_batt_level, low_batt_level);
	battery_monitor = &stc3117_battery_monitor;
#else
	#error "No battery monitor type defined! Set BATTERY_MONITOR_TYPE in CMake"
#endif
}


/**
 * @brief Phase 5 — Core services (system log, DTE handler, OTA updater, memory access).
 *
 * @param lfs_file_system  Mounted filesystem for system.log and OTA staging.
 * @param is25_flash       Raw flash device for OTA block-level writes.
 */
static void init_core_services(LFSFileSystem& lfs_file_system, Is25Flash& is25_flash)
{
	DEBUG_INFO("Creating log files...");
	static SysLogFormatter sys_log_formatter;
	static FsLog fs_system_log(&lfs_file_system, "system.log", 1024*1024);
	fs_system_log.set_log_formatter(&sys_log_formatter);
	DebugLogger::system_log = &fs_system_log;

